<?php
namespace haiyin\core\impl;

use haiyin\core\support\Rsa;
use haiyin\core\support\Aes;

abstract class ApiInterface
{
    const BASE_URL = "https://open-test.hiyintech.com";

    const RESPONSE_CODE_TABLE = [
        "0000" => "受理成功",

        //http头验证
        "1000" => "HEADER参数验证错误",
        "1001" => "APIKEY验证失败",
        "1002" => "ApiKey账户已停用",
        "1003" => "密钥摘要错误",
        "1004" => "IP地址不在白名单",
        "1005" => "参数值不合法",

        //http请求
        "1100" => "错误的请求方法",
        "1101" => "参数验证错误",
        "1102" => "错误的数据格式",

        //基础配置、业务权限、签约关系验证类
        "1200" => "代征企业编号不存在",
        "1201" => "用工企业编号不存在",
        "1202" => "用工企业未合作",
        "1203" => "用工企业还未与代征企业合作签约",
        "1204" => "未设置服务费率",
        "1205" => "订单类型不存在",

        //用户身份验证类、OCR验证类、手机号验证类错误
        "1300" => "该人员未认证",
        "1301" => "用户未签约",
        "1303" => "实名认证失败",
        "1304" => "实人认证失败",
        "1305" => "OCR认证失败",
        "1306" => "人员认证中",

        //银行卡验证
        "1400" => "银行卡验证错误",
        "1401" => "银行卡不一致",
        "1402" => "银行卡未认证",
        "1403" => "银行卡验证未通过",
        "1404" => "银行卡已注销",

        //支付类错误码
        "2000" => "用工企业未发起代付",
        "2001" => "用工企业已发起代付",
        "2002" => "支付处理中",
        "2003" => "支付失败",
        "2004" => "支付出现错误",

        //交易验证类错误码
        "2100" => "订单号重复",
        "2101" => "订单号不存在",
        "2102" => "订单金额小于最低限额",
        "2103" => "订单金额超过最高限额",
        "2104" => "订单金额不合法",
        "2105" => "收款人本月超额",
        "2106" => "支付通道编号异常",
        "2107" => "用工企业支付账户错误",
        "2108" => "余额不足",
        "2109" => "银行编号不存在",

        //发票类
        "2300" => "发票申请错误",
        "2301" => "信息不存在",

        //第三方服务错误
        "3000" => "银行账户维护中暂时无法发起支付",
        
        //系统通用类错误
        "9000" => "系统检查异常",
        "9001" => "数据异常",
    ];

    //代征企业列表
    const ENTERPRISE_TABLE = [
        "KFHT001" => "开封海通科技有限公司",
        "SXHT002" => "山西海通科技有限公司",
    ];

    //支付通道表
    const PAY_CHANNEL_TABLE = [
        "1101" => "平安银行",
        "1102" => "浦发银行",
        "1103" => "众邦银行",
        "1201" => "支付宝",
        "1202" => "微信支付",
        "1203" => "中金支付",
        "1204" => "和包支付",
    ];

    //认证及签约状态表
    const AUTH_STATUS_TABLE = [
        "00" => "未认证,未签约",
        "01" => "已认证,未签约",
        "02" => "已认证,已签约",
        "03" => "认证中",
        "04" => "认证失败",
    ];

    //订单状态表
    const ORDER_STATUS_TABLE = [
        "0" => "已创建",
        "1" => "支付中",
        "2" => "待支付",
        "3" => "支付成功",
        "4" => "支付失败",
        "7" => "已作废",
    ];

    //订单类型表
    const ORDER_TYPE_TABLE = [
        "1001" => "技术服务费",
        "1002" => "设计费",
        "1003" => "推广费用",
        "1004" => "会务服务",
        "1005" => "技术服务",
        "1006" => "税务咨询服务",
        "1007" => "组织文化艺术交流活动",
        "1008" => "物业管理服务",
        "1009" => "物流代理服务",
        "1010" => "装卸搬运服务",
        "1011" => "商标代理服务",
        "1012" => "家庭服务",
        "1013" => "保洁服务",
        "1014" => "汽车美容服务",
        "1015" => "车保养服务",
        "1016" => "代驾服务",
        "1017" => "救援服务",
        "1018" => "互联网信息咨询服务",
        "1019" => "招标代理服务",
        "1020" => "投标代理服务",
        "1021" => "发布广告服务",
        "1022" => "制作广告服务",
        "1023" => "代理广告服务",
        "1024" => "电路技术支持服务",
        "1025" => "业务流程管理服务",
        "1026" => "工程设计服务",
        "1027" => "展览展示服务",
        "1028" => "文化服务",
        "1029" => "体育服务",
        "1030" => "教育辅助服务",
        "1031" => "测绘服务",
        "1032" => "城市规划设计服务",
        "1033" => "研发和技术服务",
        "1034" => "设备售后服务",
        "1035" => "物流辅助服务",
        "1036" => "商务辅助服务",
        "1037" => "医疗辅助服务",
        "1038" => "房产经纪服务",
        "1039" => "其他现代服务",
    ];

    //发票类型表
    const INVOICE_TYPE_TABLE = [
        "1" => "增值税普通发票",
        "2" => "增值税专用发票",
    ];

    //发票内容编码表
    const INVOICE_CONTENT_TABLE = [
        "101" => "研发和技术服务*技术服务费",
        "102" => "设计服务*设计费",
        "103" => "现代服务*推广费用",
        "104" => "人力资源服务*服务费",
        "105" => "人力资源服务*信息服务",
        "106" => "人力咨询服务*咨询服务",
        "107" => "会展服务*会务服务",
        "108" => "信息技术服务*技术服务",
        "109" => "企业管理服务*咨询服务",
        "110" => "企业管理服务*服务费",
        "111" => "一般税务咨询*税务咨询服务",
        "112" => "文化服务*组织文化艺术交流活动",
        "113" => "生活服务*物业管理服务",
        "114" => "其他经纪代理*物流代理",
        "115" => "物流辅助服务*装卸搬运服务",
        "116" => "经纪代理服务*商标代理服务",
        "117" => "生活服务*家庭服务",
        "118" => "生活服务*保洁服务",
        "119" => "生活服务*汽车美容服务",
        "120" =>  "生活服务*汽车保养服务",
        "121" => "生活服务*代驾服务",
        "122" => "生活服务*救援服务",
        "123" => "信息技术服务*互联网信息咨询服务",
        "124" => "经纪代理服务*招标代理服务",
        "125" => "经纪代理服务*投标代理服务",
        "126" => "广告服务*发布广告服务",
        "127" => "广告服务*制作广告服务",
        "128" => "广告代理服务*代理广告服务",
        "129" => "信息技术服务*电路技术支持服务",
        "130" => "信息技术服务*业务流程管理服务",
        "131" => "设计服务*工程设计服务",
        "132" => "会展服务*展览展示服务",
        "133" => "文化服务*文化服务",
        "134" => "体育服务*体育服务",
        "135" => "现代服务*推广费用",
        "136" => "教育辅助服务*咨询服务",
        "137" => "建筑服务*测绘服务",
        "138" => "建筑服务*城市规划设计服务",
        "139" => "研发和技术服务*专业技术服务",
        "140" => "建筑服务*设备售后服务",
        "141" => "物流辅助服务*物流辅助服务",
        "142" => "企业管理服务*商务辅助服务",
        "143" => "医疗服务*医疗辅助服务",
        "144" => "旅游服务*旅游服务",
        "145" => "经纪代理服务*房产经纪服务",
    ];


    abstract public function api();
    
    public function request()
    {
        $vars = get_object_vars($this);
        $data = [];
        foreach ($vars as $key => $var) {
            $data[$key] = $var;
        }
        return $data;
    }

    /**
	 * 处理服务端返回结果
	 * 
	 * @param string $resp api接口返回json
	 * @param ConfigInterface $config  配置对象
	 */
    public function response($resp, $config) 
    {
        $json = json_decode($resp, true);
        //服务端对返回结果进行了加密
        if (!empty($json["data"])) {
            $body = json_decode(base64_decode($json["data"]), true);
            $aesKey = Rsa::decrypt($body["encryptKey"], $config->getSelfPrivateKey());
            $json["data"] = json_decode(Aes::decrypt($body["encryptMsg"], $aesKey), true);
        }
        return $json;
    }
}